Revit 2027 API
CurtainSystem.CurtainSystemType Property
get or set the type of the CurtainSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurtainSystemType CurtainSystemType { get; set; }
Public Property CurtainSystemType As CurtainSystemType
	Get
	Set
public:
property CurtainSystemType^ CurtainSystemType {
	CurtainSystemType^ get ();
	void set (CurtainSystemType^ value);
}
member CurtainSystemType : CurtainSystemType with get, set
Property Value
CurtainSystemType
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the specified parameter curtainSystemType is null.
InvalidOperationException |  Thrown when the type of the CurtainSystem cannot be changed to the specified one.
See Also
Reference
CurtainSystem Class
Autodesk.Revit.DB Namespace